Ryan-Rogers/MMSoftware/MM_2015.X/support/pic24f/h/p24F08KL301.h
#define _CCP1CON_PM1_POSITION                    0x00000007
#define _CCP1CON_PM1_MASK                        0x00000080
#define _CCP1CON_PM1_LENGTH                      0x00000001

#define _CCP1CON_CCP1M_POSITION                  0x00000000
#define _CCP1CON_CCP1M_MASK                      0x0000000F
#define _CCP1CON_CCP1M_LENGTH                    0x00000004

#define _CCP1CON_DC1B_POSITION                   0x00000004
#define _CCP1CON_DC1B_MASK                       0x00000030
#define _CCP1CON_DC1B_LENGTH                     0x00000002

#define _CCP1CON_P1M_POSITION                    0x00000006
#define _CCP1CON_P1M_MASK                        0x000000C0
#define _CCP1CON_P1M_LENGTH                      0x00000002

#define _CCP1CON_CCP1M0_POSITION                 0x00000000
#define _CCP1CON_CCP1M0_MASK                     0x00000001
#define _CCP1CON_CCP1M0_LENGTH                   0x00000001

#define _CCP1CON_CCP1M1_POSITION                 0x00000001
#define _CCP1CON_CCP1M1_MASK                     0x00000002
#define _CCP1CON_CCP1M1_LENGTH                   0x00000001

#define _CCP1CON_CCP1M2_POSITION                 0x00000002
#define _CCP1CON_CCP1M2_MASK                     0x00000004
#define _CCP1CON_CCP1M2_LENGTH                   0x00000001

#define _CCP1CON_CCP1M3_POSITION                 0x00000003
#define _CCP1CON_CCP1M3_MASK                     0x00000008
#define _CCP1CON_CCP1M3_LENGTH                   0x00000001

#define _CCP1CON_DC1B0_POSITION                  0x00000004
#define _CCP1CON_DC1B0_MASK                      0x00000010
#define _CCP1CON_DC1B0_LENGTH                    0x00000001

#define _CCP1CON_DC1B1_POSITION                  0x00000005
#define _CCP1CON_DC1B1_MASK                      0x00000020
#define _CCP1CON_DC1B1_LENGTH                    0x00000001

#define _CCP1CON_P1M0_POSITION                   0x00000006
#define _CCP1CON_P1M0_MASK                       0x00000040
#define _CCP1CON_P1M0_LENGTH                     0x00000001

#define _CCP1CON_P1M1_POSITION                   0x00000007
#define _CCP1CON_P1M1_MASK                       0x00000080
#define _CCP1CON_P1M1_LENGTH                     0x00000001

#define _ECCP1CON_CCPM_POSITION                  0x00000000
#define _ECCP1CON_CCPM_MASK                      0x0000000F
#define _ECCP1CON_CCPM_LENGTH                    0x00000004

#define _ECCP1CON_DCB_POSITION                   0x00000004
#define _ECCP1CON_DCB_MASK                       0x00000030
#define _ECCP1CON_DCB_LENGTH                     0x00000002

#define _ECCP1CON_PM_POSITION                    0x00000006
#define _ECCP1CON_PM_MASK                        0x000000C0
#define _ECCP1CON_PM_LENGTH                      0x00000002

#define _ECCP1CON_CCPM0_POSITION                 0x00000000
#define _ECCP1CON_CCPM0_MASK                     0x00000001
#define _ECCP1CON_CCPM0_LENGTH                   0x00000001

#define _ECCP1CON_CCPM1_POSITION                 0x00000001
#define _ECCP1CON_CCPM1_MASK                     0x00000002
#define _ECCP1CON_CCPM1_LENGTH                   0x00000001

#define _ECCP1CON_CCPM2_POSITION                 0x00000002
#define _ECCP1CON_CCPM2_MASK                     0x00000004
#define _ECCP1CON_CCPM2_LENGTH                   0x00000001

#define _ECCP1CON_CCPM3_POSITION                 0x00000003
#define _ECCP1CON_CCPM3_MASK                     0x00000008
#define _ECCP1CON_CCPM3_LENGTH                   0x00000001

#define _ECCP1CON_DCB0_POSITION                  0x00000004
#define _ECCP1CON_DCB0_MASK                      0x00000010
#define _ECCP1CON_DCB0_LENGTH                    0x00000001

#define _ECCP1CON_DCB1_POSITION                  0x00000005
#define _ECCP1CON_DCB1_MASK                      0x00000020
#define _ECCP1CON_DCB1_LENGTH                    0x00000001

#define _ECCP1CON_PM0_POSITION                   0x00000006
#define _ECCP1CON_PM0_MASK                       0x00000040
#define _ECCP1CON_PM0_LENGTH                     0x00000001

#define _ECCP1CON_PM1_POSITION                   0x00000007
#define _ECCP1CON_PM1_MASK                       0x00000080
#define _ECCP1CON_PM1_LENGTH                     0x00000001

#define _ECCP1CON_CCP1M_POSITION                 0x00000000
#define _ECCP1CON_CCP1M_MASK                     0x0000000F
#define _ECCP1CON_CCP1M_LENGTH                   0x00000004

#define _ECCP1CON_DC1B_POSITION                  0x00000004
#define _ECCP1CON_DC1B_MASK                      0x00000030
#define _ECCP1CON_DC1B_LENGTH                    0x00000002

#define _ECCP1CON_P1M_POSITION                   0x00000006
#define _ECCP1CON_P1M_MASK                       0x000000C0
#define _ECCP1CON_P1M_LENGTH                     0x00000002

#define _ECCP1CON_CCP1M0_POSITION                0x00000000
#define _ECCP1CON_CCP1M0_MASK                    0x00000001
#define _ECCP1CON_CCP1M0_LENGTH                  0x00000001

#define _ECCP1CON_CCP1M1_POSITION                0x00000001
#define _ECCP1CON_CCP1M1_MASK                    0x00000002
#define _ECCP1CON_CCP1M1_LENGTH                  0x00000001

#define _ECCP1CON_CCP1M2_POSITION                0x00000002
#define _ECCP1CON_CCP1M2_MASK                    0x00000004
#define _ECCP1CON_CCP1M2_LENGTH                  0x00000001

#define _ECCP1CON_CCP1M3_POSITION                0x00000003
#define _ECCP1CON_CCP1M3_MASK                    0x00000008
#define _ECCP1CON_CCP1M3_LENGTH                  0x00000001

#define _ECCP1CON_DC1B0_POSITION                 0x00000004
#define _ECCP1CON_DC1B0_MASK                     0x00000010
#define _ECCP1CON_DC1B0_LENGTH                   0x00000001

#define _ECCP1CON_DC1B1_POSITION                 0x00000005
#define _ECCP1CON_DC1B1_MASK                     0x00000020
#define _ECCP1CON_DC1B1_LENGTH                   0x00000001

#define _ECCP1CON_P1M0_POSITION                  0x00000006
#define _ECCP1CON_P1M0_MASK                      0x00000040
#define _ECCP1CON_P1M0_LENGTH                    0x00000001

#define _ECCP1CON_P1M1_POSITION                  0x00000007
#define _ECCP1CON_P1M1_MASK                      0x00000080
#define _ECCP1CON_P1M1_LENGTH                    0x00000001

#define _ECCP1DEL_PDC_POSITION                   0x00000000
#define _ECCP1DEL_PDC_MASK                       0x0000007F
#define _ECCP1DEL_PDC_LENGTH                     0x00000007

#define _ECCP1DEL_PRSEN_POSITION                 0x00000007
#define _ECCP1DEL_PRSEN_MASK                     0x00000080
#define _ECCP1DEL_PRSEN_LENGTH                   0x00000001

#define _ECCP1DEL_PDC0_POSITION                  0x00000000
#define _ECCP1DEL_PDC0_MASK                      0x00000001
#define _ECCP1DEL_PDC0_LENGTH                    0x00000001

#define _ECCP1DEL_PDC1_POSITION                  0x00000001
#define _ECCP1DEL_PDC1_MASK                      0x00000002
#define _ECCP1DEL_PDC1_LENGTH                    0x00000001

